



<h1 align = "center">2021互联网计算实验报告</h1>












### 目录

- [2021互联网计算实验报告](#2021%E4%BA%92%E8%81%94%E7%BD%91%E8%AE%A1%E7%AE%97%E5%AE%9E%E9%AA%8C%E6%8A%A5%E5%91%8A)
    - [目录](#%E7%9B%AE%E5%BD%95)
    - [实验要求](#%E5%AE%9E%E9%AA%8C%E8%A6%81%E6%B1%82)
    - [使用技术](#%E4%BD%BF%E7%94%A8%E6%8A%80%E6%9C%AF)
    - [实验目标](#%E5%AE%9E%E9%AA%8C%E7%9B%AE%E6%A0%87)
    - [实验内容](#%E5%AE%9E%E9%AA%8C%E5%86%85%E5%AE%B9)
    - [实验拓扑](#%E5%AE%9E%E9%AA%8C%E6%8B%93%E6%89%91)
      - [Step 1 配置PC](#step-1-%E9%85%8D%E7%BD%AEpc)
      - [Step 2 配置路由器](#step-2-%E9%85%8D%E7%BD%AE%E8%B7%AF%E7%94%B1%E5%99%A8)
          - [Router1](#router1)
          - [Router2](#router2)
          - [Router3](#router3)
          - [Router4](#router4)
      - [Step 3 RIP](#step-3-rip)
          - [Router1](#router1-1)
          - [Router2](#router2-1)
          - [Router3](#router3-1)
          - [Router4](#router4-1)
          - [验证RIP](#%E9%AA%8C%E8%AF%81rip)
      - [Step 4 VLAN划分与Trunk配置](#step-4-vlan%E5%88%92%E5%88%86%E4%B8%8Etrunk%E9%85%8D%E7%BD%AE)
          - [Switch1](#switch1)
          - [Switch2](#switch2)
          - [Router1](#router1-2)
          - [验证VLAN](#%E9%AA%8C%E8%AF%81vlan)
      - [Step 5 NAT](#step-5-nat)
          - [Router1](#router1-3)
          - [验证NAT](#%E9%AA%8C%E8%AF%81nat)
      - [Step 6 配置ACL](#step-6-%E9%85%8D%E7%BD%AEacl)
          - [Router3](#router3-2)
          - [验证ACL](#%E9%AA%8C%E8%AF%81acl)
      - [Step 7 配置PPP](#step-7-%E9%85%8D%E7%BD%AEppp)
          - [Router 3 (server)](#router-3-server)
          - [Router 4 (client)](#router-4-client)
          - [验证](#%E9%AA%8C%E8%AF%81)
      - [总结](#%E6%80%BB%E7%BB%93)


### 实验要求

0. 自行设计拓扑，现场实现之，完成后提交报告予现场助教或老师确认。  
1. 拓扑需使用动态路由协议。   
2. 拓扑中需包含VLAN及trunk技术。   
3. 拓扑至少需包含设备：2台交换机、4台路由器、4台PC。  
4. 每组时间为60分钟。   
5. 上机报告需包含拓扑说明、相关路由表信息、连通性说明。提交时现场助教或老师将在现场确认。 
6. 每组结束后需要清除设备配置保证设备正常交由助教确认后方可离开。

```
 1、完成规定的基本要求为90分。   
 2、提前较多时间(30分钟)完成考试、拓扑中设计较为复杂的网络技术（如ACL，NAT等）等将有加分。  
 3、上机考试中助教或老师会现场抽查考生关于其所在组拓扑相关的问题，若表现极差会降低该组总分
```



### 使用技术
  - RIP 路由协议
  - VLAN 路由连接
  - Trunk 技术
  - ACL 防火墙设置
  - NAT 技术
  - PPP
### 实验目标
  1. 掌握在路由器上启动 RIP 路由进程
  2. 掌握查看和调试 RIP 路由协议相关信息
  3. 深入了解交换机 VLAN 的配置
  4. 熟悉不同 VLAN 之间路由的配置
  5. 熟悉 Trunk 的配置
  6. 掌握静态 NAT 的配置和基本调试
  7. 掌握 ACL 的配置
  8. 掌握 PPP 的配置
### 实验内容
1. 配置 RIP

2. 配置 VLAN

3. 配置 Trunk

4. 配置 NAT

5. 配置 ACL

6. 配置PPP

### 实验拓扑

![拓扑](img/拓扑.png)





#### Step 1 配置PC

==截PC1的图==

PC 1:

IP 地址: 192.168.10.2

子网掩码: 255.255.255.0

默认网关: 192.168.10.1



PC 2:

IP 地址: 192.168.20.2

子网掩码: 255.255.255.0

默认网关: 192.168.20.1



PC 3:

IP 地址: 192.168.10.3

子网掩码: 255.255.255.0

默认网关: 192.168.10.1



PC 4:

IP 地址: 192.168.20.3

子网掩码: 255.255.255.0

默认网关: 192.168.20.1

#### Step 2 配置路由器

###### Router1

```bash
Router1>enable 
Router1#config terminal 
Router1(config)#int s0/1/0 
Router1(config-if)#ip address 202.202.202.1 255.255.255.0 
Router1(config-if)#no shut
Router1(config-if)#exit
```

###### Router2

```bash
Router2>enable 
Router2#config terminal 
Router2(config)#int s0/1/0 
Router2(config-if)#ip address 203.203.203.1 255.255.255.0
Router2(config-if)#no shut 
Router2(config-if)#exit
Router2(config)#int s0/1/1 
Router2(config-if)#ip address 202.202.202.2 255.255.255.0
Router2(config-if)#no shut 
Router2(config-if)#exit
```
###### Router3

```bash
Router3>enable 
Router3#config terminal 
Router3(config)#int s0/1/0 
Router3(config-if)#ip address 204.204.204.1 255.255.255.0
Router3(config-if)#no shut 
Router3(config-if)#exit
Router3(config)#int s0/1/1 
Router3(config-if)#ip address 203.203.203.2 255.255.255.0
Router3(config-if)#no shut
Router3(config-if)#exit
```
###### Router4

```bash
Router4>enable 
Router4#config terminal 
Router4(config)#int s0/1/1
Router4(config-if)#ip address 204.204.204.2 255.255.255.0 
Router4(config-if)#no shut
Router4(config-if)#exit
```

#### Step 3 RIP

###### Router1

```bash
Router1(config)#router rip 
Router1(config-router)#network 192.168.10.0 
Router1(config-router)#network 192.168.20.0 
Router1(config-router)#network 202.202.202.0 
Router1(config-router)#end
```

###### Router2

```bash
Router2(config)#router rip 
Router2(config-router)#network 202.202.202.0 
Router2(config-router)#network 203.203.203.0 
Router2(config-router)#end
```
###### Router3

```bash
Router3(config)#router rip 
Router3(config-router)#network 203.203.203.0 
Router3(config-router)#network 204.204.204.0 
Router3(config-router)#end
```
###### Router4

```bash
Router4(config)#router rip 
Router4(config-router)#network 204.204.204.0 
Router4(config-router)#end
```

###### 验证RIP

用 Router1 ping Router4

即从 202.202.202.1 ping 204.204.204.2

能够 ping 通

则说明RIP配置完成

==ping通截图==



查看路由表

```bash
Router1#show ip route
```

==ping通后Router1输入 show ip route截图==

#### Step 4 VLAN划分与Trunk配置

###### Switch1 

```bash
Switch1(config)#vlan 10
Switch1(config)#vlan 20
Switch1(config)#int g1/0/23
Switch1(config-if)#switchport mode trunk 
Switch1(config-if)#exit
Switch1(config)#int g1/0/24
Switch1(config-if)#switchport mode trunk 
Switch1(config-if)#exit

Switch1(config)#int g1/0/1 
Switch1(config-if)#switchport mode access 
Switch1(config-if)#switchport access vlan 10 
Switch1(config-if)#exit
Switch1(config)#int g1/0/2 
Switch1(config-if)#switchport mode access 
Switch1(config-if)#switchport access vlan 20
```

###### Switch2

```bash
Switch2(config)#vlan 10
Switch2(config)#vlan 20
Switch2(config)#int g1/0/23
Switch2(config-if)#switchport mode trunk 
Switch2(config-if)#exit

Switch2(config)#int g1/0/1 
Switch2(config-if)#switchport mode access 
Switch2(config-if)#switchport access vlan 10
Switch2(config-if)#int g1/0/2 
Switch2(config-if)#switchport mode access 
Switch2(config-if)#switchport access vlan 20
```

###### Router1

```bash
Router1#configure terminal 
Router1(config)#int g0/0/0 
Router1(config-if)#no ip address 
Router1(config-if)#no shut
Router1(config-if)#exit
Router1(config)#int g0/0/0.10 
Router1(config-if)#encapsulation dotlq 10 
Router1(config-if)#ip address 192.168.10.1 255.255.255.0
Router1(config-if)#no shut 
Router1(config-if)#exit
Router1(config)#int g0/0/0.20 
Router1(config-if)#encapsulation dotlq 20 
Router1(config-if)#ip address 192.168.20.1 255.255.255.0
Router1(config-if)#no shut
```

###### 验证VLAN

用PC1 ping PC2,3,4 

能ping通：说明vlan配置成功

==ping通截图==



```bash
Switch1#show vlan brief
Switch2#show vlan brief
```

==这两条命令截图==

#### Step 5 NAT

###### Router1

```bash
Router1(config)#ip nat source static 192.168.10.2 202.202.202.4
Router1(config)#ip nat source static 192.168.10.3 202.202.202.5
Router1(config)#ip nat source static 192.168.20.2 202.202.202.6
Router1(config)#ip nat source static 192.168.20.3 202.202.202.7
Router1(config)#int g0/0/0 
Router1(config-if)#ip nat inside 
Router1(config-if)#exit
Router1(config)#int s0/1/0 
Router1(config-if)#ip nat outside
```

###### 验证NAT

```bash
Routerl#show ip nat translations
```

==NAT表截图==

从PC1 ping Router4

```bash
PC1 ping 204.204.204.2
```

==ping 通截图==

#### Step 6 配置ACL

###### Router3

```bash
Router3#config terminal 
Router3(config)#access-list 100 deny icmp host 202.202.202.4 host 204.204.204.2 Router3(config)#access-list 100 permit icmp any any 
Router3(config)#int s0/1/1
Router3(config-if)#ip access-group 100 in
```

###### 验证ACL

```bash
Router3#show access-list
```

==截图==

再用PC1 ping Router4，发现已经ping不通了，刚才能通说明NAT正确，现在不通说明ACL正确

```bash
PC1 ping 204.204.204.2
```

==ping 不通截图==

#### Step 7 配置PPP

###### Router 3 (server)

```bash
Router3(config)#username nju password ccna
Router3(config)#int s0/1/0
Router3(config-if)#encapsulation ppp
Router3(config-if)#ppp authentication pap
Router3(config-if)#no shut
Router3(config-if)#exit
```

###### Router 4 (client)

```bash
Router4(config)#interface serial 0/0
Router4(config-if)#encapsulation ppp
Router4(config-if)#no shut
```

###### 验证

首先ping一下，能ping通

```bash
Router4#ping 204.204.204.1
```

==截图==



在client端(Router4)使用错误账号密码，ping不通

```bash
Router4(config-if)#ppp pap sent-username abcd password abcd
Router4(config-if)#end
Router4#ping 204.204.204.1
```

==截图==



在client端(Router4)使用正确账号密码，能ping通

```bash
Router4(config-if)#ppp pap sent-username nju password ccna
Router4(config-if)#end
Router4#ping 204.204.204.1
```

==截图==



#### 总结

```
通过RIP联通网段202.202.202.0/24，203.203.203.0/24，204.204.204.0/24

通过VLAN和Trunk技术，使192.168.10.0网段和192.168.20.0网段通信

通过NAT技术，将192.168.10.0网段和192.168.20.0网段静态映射到202.202.202.0网段上地址与其他网段实现通信

通过在Router3设置ACL,实现阻止202.202.202.4(PC1)到204.204.204.2的转发

通过在Router3和Router4间设置PAP，完成了PAP验证
```